{"pageProps":{"post":{"id":"why-duplication-can-be-cheaper-than-the-wrong-abstraction","title":"Why Duplication Can Be Cheaper Than The Wrong Abstraction","excerpt":"In software development, it is often said that duplication can be cheaper than creating the wrong abstraction. This blog explores why and provides insights on avoiding the pitfalls of premature abstraction.","content":"In the world of software development, we are often taught about the importance of the DRY (Don't Repeat Yourself) principle. While this principle aims to reduce code duplication, it can sometimes lead us into the trap of premature abstraction, where we end up creating abstractions before fully understanding the requirements. As Sandi Metz famously stated, \"Duplication is far cheaper than the wrong abstraction.\"\n\n## Understanding the Wrong Abstraction\n\nSandi Metz, in her insightful blog post [The Wrong Abstraction](https://sandimetz.com/blog/2016/1/20/the-wrong-abstraction), describes how programmers often see duplication and quickly move to extract it into a shared abstraction. At first, this seems like a good idea, but as new requirements emerge, the shared abstraction starts to bend and twist to accommodate new scenarios. This process usually involves adding parameters and conditional statements, leading to code that is hard to understand and maintain.\n\nMetz provides an example pattern:\n\n1. Programmer A sees duplication and extracts it into a new abstraction.\n2. New requirements arise. Programmer B modifies the abstraction to handle these requirements, adding parameters and conditionals.\n3. The abstraction becomes increasingly complex and harder to work with over time.\n\nEventually, the abstraction no longer serves its original purpose and becomes a source of confusion and bugs.\n\n## The Cost of the Wrong Abstraction\n\nThe sunk cost fallacy often traps developers into maintaining and evolving a wrong abstraction. Just because effort was spent creating an abstraction, we feel obligated to preserve it, even when it makes the codebase harder to work with. But as Metz advises, sometimes the fastest way forward is to go back and reintroduce duplication.\n\nHere's a step-by-step approach to fix this problem as suggested by Metz:\n\n1. Re-introduce duplication by inlining the previously extracted code back into every caller.\n2. Within each caller, determine and retain only the parts of the inlined code that are necessary.\n3. Delete the bits that aren't needed for the specific caller.\n\nThis process removes both the wrong abstraction and unnecessary conditionals, reducing each caller to only what it needs. This can make the codebase much easier to understand and work with.\n\n## Why Duplication is Preferable in Some Cases\n\nDuplication can be seen as a way to keep things simple until the right abstraction becomes evident. When each piece of duplicate code evolves independently, the need for a proper abstraction might become more apparent through repeated adjustments. By then, you’ll have a better understanding of what the shared code should look like.\n\n## Conclusion\n\nWhile DRY is a valuable principle, it should be applied with caution. Premature abstraction can lead to complex and brittle code that is hard to maintain. By understanding that duplication can sometimes be cheaper and refraining from creating abstractions too early, we can maintain cleaner and more manageable codebases. Remember, the right abstraction can simplify your code, but the wrong one can make it a nightmare.\n\n## References\n\n- [The Wrong Abstraction by Sandi Metz](https://sandimetz.com/blog/2016/1/20/the-wrong-abstraction)\n- Various online articles and discussions about the pitfalls of premature abstraction and the benefits of carefully considered code duplication.\n","datePosted":"2025-03-20T09:00:17.720155Z","postedBy":"Elijah Mondero","tags":["software development","programming","code duplication","abstraction","DRY principle"],"sources":["https://sandimetz.com/blog/2016/1/20/the-wrong-abstraction"],"image_path":"/posts/images/a59640d7-9590-4118-a1ba-c807cd1bd525.png"}},"__N_SSG":true}